extends CheckButton

const words = ["はい", "いいえ", "ありがとう", "ごめん", "すみません", "どこ", "いつ", "いくら", "どうして", 
"あなた", "ねこ", "いぬ", "ほんとう", "あぶない", "わたし", "はな", "おはよう", "さようなら", "こんにちは",
"あの", "ある", "です", "こと", "いる", "なに", "すき", "どうぞ", "ふゆ", "あき", "やばい", "なるほど",
"なんで", "きょう", "あした", "だれ", "なつ", "はる", "がっこう", "よろしく", "きゅう", "いち", "じゅう",
"べんきょう", "ほしい", "おいしい", "らめん", "まんが", "あにめ", "かようび", "かれー", "りょかい",
"こーひー", "おちゃ", "こうちゃ", "ちょっと", "すこし", "まあまあ", "げんき", "ゆうごはん", "うん",
"うれしい", "ひま", "おやすみ", "いきたい", "ありません", "いちご", "べんとう", "とり", "さかな", "こんばんは"]

func _ready():
	if (Global.current_target == "words"):
		Global.targetPool = words;
		button_pressed = true;

func _pressed():
	Global.targetPool = words;
	Global.current_target = "words";
